In [ ]:
import pandas as pd
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
df.head(10)

    ano      mes estado    numero    encontro
0  1998  Janeiro   Acre   0 Fires  01-01-1998
1  1999  Janeiro   Acre   0 Fires  01-01-1999
2  2000  Janeiro   Acre   0 Fires  01-01-2000
3  2001  Janeiro   Acre   0 Fires  01-01-2001
4  2002  Janeiro   Acre   0 Fires  01-01-2002
5  2003  Janeiro   Acre  10 Fires  01-01-2003
6  2004  Janeiro   Acre   0 Fires  01-01-2004
7  2005  Janeiro   Acre  12 Fires  01-01-2005
8  2006  Janeiro   Acre   4 Fires  01-01-2006
9  2007  Janeiro   Acre   0 Fires  01-01-2007

In [ ]:
df.tail(10)

      ano        mes estado numero    encontro
505  2004  Fevereiro  Amapa      2  01-01-2004
506  2005  Fevereiro  Amapa      1  01-01-2005
507  2006  Fevereiro  Amapa      2  01-01-2006
508  2007  Fevereiro  Amapa      0  01-01-2007
509  2008  Fevereiro  Amapa      0  01-01-2008
510  2009  Fevereiro  Amapa      0  01-01-2009
511  2010  Fevereiro  Amapa      0  01-01-2010
512  2011  Fevereiro  Amapa      3  01-01-2011
513  2012  Fevereiro  Amapa      5  01-01-2012
514  2013  Fevereiro  Amapa      0  01-01-2013

In [ ]:
import pandas as pd
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
df.tail()

      ano        mes estado numero    encontro
510  2009  Fevereiro  Amapa      0  01-01-2009
511  2010  Fevereiro  Amapa      0  01-01-2010
512  2011  Fevereiro  Amapa      3  01-01-2011
513  2012  Fevereiro  Amapa      5  01-01-2012
514  2013  Fevereiro  Amapa      0  01-01-2013

In [ ]:
df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa'], dtype=object)

# Rename coumns

In [ ]:
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encountro':'date'}

In [ ]:
df.head()

    ano      mes estado   numero    encontro
0  1998  Janeiro   Acre  0 Fires  01-01-1998
1  1999  Janeiro   Acre  0 Fires  01-01-1999
2  2000  Janeiro   Acre  0 Fires  01-01-2000
3  2001  Janeiro   Acre  0 Fires  01-01-2001
4  2002  Janeiro   Acre  0 Fires  01-01-2002

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515 entries, 0 to 514
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       515 non-null    int64
 1   mes       515 non-null    object
 2   estado    515 non-null    object
 3   numero    510 non-null    object
 4   encontro  515 non-null    object
dtypes: int64(1), object(4)
memory usage: 20.2+ KB

In [ ]:
df.head()

    ano      mes estado   numero    encontro
0  1998  Janeiro   Acre  0 Fires  01-01-1998
1  1999  Janeiro   Acre  0 Fires  01-01-1999
2  2000  Janeiro   Acre  0 Fires  01-01-2000
3  2001  Janeiro   Acre  0 Fires  01-01-2001
4  2002  Janeiro   Acre  0 Fires  01-01-2002

In [ ]:
new_order =[4,1,0,2,3]
df = df[df.columns[new_order]]
df.head

<bound method NDFrame.head of        encontro        mes   ano estado   numero
0    01-01-1998    Janeiro  1998   Acre  0 Fires
1    01-01-1999    Janeiro  1999   Acre  0 Fires
2    01-01-2000    Janeiro  2000   Acre  0 Fires
3    01-01-2001    Janeiro  2001   Acre  0 Fires
4    01-01-2002    Janeiro  2002   Acre  0 Fires
..          ...        ...   ...    ...      ...
510  01-01-2009  Fevereiro  2009  Amapa        0
511  01-01-2010  Fevereiro  2010  Amapa        0
512  01-01-2011  Fevereiro  2011  Amapa        3
513  01-01-2012  Fevereiro  2012  Amapa        5
514  01-01-2013  Fevereiro  2013  Amapa        0

[515 rows x 5 columns]>

In [ ]:
df.head(10)

     encontro      mes   ano estado    numero
0  01-01-1998  Janeiro  1998   Acre   0 Fires
1  01-01-1999  Janeiro  1999   Acre   0 Fires
2  01-01-2000  Janeiro  2000   Acre   0 Fires
3  01-01-2001  Janeiro  2001   Acre   0 Fires
4  01-01-2002  Janeiro  2002   Acre   0 Fires
5  01-01-2003  Janeiro  2003   Acre  10 Fires
6  01-01-2004  Janeiro  2004   Acre   0 Fires
7  01-01-2005  Janeiro  2005   Acre  12 Fires
8  01-01-2006  Janeiro  2006   Acre   4 Fires
9  01-01-2007  Janeiro  2007   Acre   0 Fires

In [ ]:
df.tail()

       encontro        mes   ano estado numero
510  01-01-2009  Fevereiro  2009  Amapa      0
511  01-01-2010  Fevereiro  2010  Amapa      0
512  01-01-2011  Fevereiro  2011  Amapa      3
513  01-01-2012  Fevereiro  2012  Amapa      5
514  01-01-2013  Fevereiro  2013  Amapa      0

In [ ]:
df.tail(10)

       encontro        mes   ano estado numero
505  01-01-2004  Fevereiro  2004  Amapa      2
506  01-01-2005  Fevereiro  2005  Amapa      1
507  01-01-2006  Fevereiro  2006  Amapa      2
508  01-01-2007  Fevereiro  2007  Amapa      0
509  01-01-2008  Fevereiro  2008  Amapa      0
510  01-01-2009  Fevereiro  2009  Amapa      0
511  01-01-2010  Fevereiro  2010  Amapa      0
512  01-01-2011  Fevereiro  2011  Amapa      3
513  01-01-2012  Fevereiro  2012  Amapa      5
514  01-01-2013  Fevereiro  2013  Amapa      0

# Determine if the columns contain the numerical data

In [ ]:
df['number_of_fires'].str.isnumeric()

0      False
4      False
5      False
6      False
7      False
       ...
506     True
507     True
508     True
509     True
510     True
Name: number_of_fires, Length: 508, dtype: object

In [ ]:
df['number_of_fires'].astype(str).str.isdigit()

0      False
4      False
5      False
6      False
7      False
       ...
506     True
507     True
508     True
509     True
510     True
Name: number_of_fires, Length: 508, dtype: bool

In [ ]:
df['number_of_fires'].str.strip("Fires")

0      0
4      4
5      0
6      0
7      0
       ..
506     0
507     0
508     3
509     5
510     0
Name: number_of_fires, Length: 508, dtype: object

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 508 entries, 0 to 510
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   level_0          508 non-null    int64
 1   index            508 non-null    int64
 2   year             508 non-null    int64
 3   state            508 non-null    object
 4   number_of_fires  503 non-null    object
dtypes: int64(3), object(2)
memory usage: 23.8+ KB

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull()

      year  month  state  number_of_fires   date
0    False  False  False            False  False
1    False  False  False            False  False
2    False  False  False            False  False
3    False  False  False            False  False
4    False  False  False            False  False
..     ...    ...    ...              ...    ...
510  False  False  False            False  False
511  False  False  False            False  False
512  False  False  False            False  False
513  False  False  False            False  False
514  False  False  False            False  False

[515 rows x 5 columns]

In [ ]:
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    5
date               0
dtype: int64

In [ ]:
df = df.dropna()
df = df.reset_index()
df.head()

   index  year    month state number_of_fires        date
0      0  1998  Janeiro  Acre              0   01-01-1998
1      1  1999  Janeiro  Acre              0   01-01-1999
2      2  2000  Janeiro  Acre              0   01-01-2000
3      3  2001  Janeiro  Acre              0   01-01-2001
4      4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 508 entries, 0 to 510
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   level_0          508 non-null    int64
 1   index            508 non-null    int64
 2   year             508 non-null    int64
 3   state            508 non-null    object
 4   number_of_fires  503 non-null    object
dtypes: int64(3), object(2)
memory usage: 23.8+ KB

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()
df=df.drop(['year','date'],axis=1)
df.head()

     month state number_of_fires
0  Janeiro  Acre              0
1  Janeiro  Acre              0
2  Janeiro  Acre              0
3  Janeiro  Acre              0
4  Janeiro  Acre              0

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()
df = df.drop(['month','date'],axis=1)
df.head()

   year state number_of_fires
0  1998  Acre              0
1  1999  Acre              0
2  2000  Acre              0
3  2001  Acre              0
4  2002  Acre              0

In [ ]:
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index  year state number_of_fires
0      1  1999  Acre              0
1      2  2000  Acre              0
2      3  2001  Acre              0
3      4  2002  Acre              0
4      5  2003  Acre             10

In [ ]:
df = df.drop(df.index[1:4])
df = df.reset_index()
df.head()

   level_0  index  year state number_of_fires
0        0      1  1999  Acre              0
1        4      5  2003  Acre             10
2        5      6  2004  Acre              0
3        6      7  2005  Acre             12
4        7      8  2006  Acre              4

In [ ]:
df = df.drop(df.index[1:4])
df.head()

   level_0  index  year state number_of_fires
0        0      1  1999  Acre              0
4        7      8  2006  Acre              4
5        8      9  2007  Acre              0
6        9     10  2008  Acre              0
7       10     11  2009  Acre              0